/** 1. Имеется массив случайных чисел. Написать алгоритм, позволяющий выполнить сортировку элементов по убыванию.
 2. Имеется массив случайных чисел. Написать алгоритм, позволяющий выполнить сортировку элементов по возрастанию.
 3. Имеется массив случайных чисел. Написать алгоритм разбиения этого массива на две половины - два отдельных массива.
 4. Имеется массив случайных чисел. Написать алгоритм, позволяющий сгенерировать из исходного - новый массив,
 содержащий только положительные числа.
 5. Имеется массив случайных чисел. Написать алгоритм, позволяющий сгенерировать из исходного - новый массив,
 состоящий только из отрицательных чисел.
 6. Имеется массив случайных чисел. Написать алгоритм, позволяющий сгенерировать из исходного массива - новый,
 содержащий все элементы исходного массива, но отсортированные по возрастанию.
 7. Написать алгоритм, позволяющий из массива чисел, сгенерировать два новых массива - первый, содержащий только
 отрицательные числа и второй - только  положительные.
 8. Имеется массив, заполненный случайными значениями, которые вводит пользователь.
 Отсортировать массив в прямом порядке
 9. Имеется массив, заполненный случайными значениями, которые вводит пользователь.
 Отсортировать массив в обратном порядке
 10. Заполнить массив случайными числами в пределах от 0,5 до 8,6*/


package javaPlainLanguage.practicalWork8ArrayProcessingAlgorithms;

public class Test1 {
}
