/**
 * Вариант 1.  Из слова информатика путем "вырезок" и "склеек" его букв получить слова форма и тик.
 * Вариант 2.  Дана строка, заканчивающаяся точкой. Подсчитать сколько символов в строке, не учитывая пробелы
 * Вариант 3.  Дана строка, заканчивающаяся точкой. Подсчитать сколько цифр в строке.
 * Вариант 4. Даны две фамилии. Выяснить одинаковы ли они, если нет, то определить, какая из них длиннее
 * Вариант 5. Даны названия трех городов. Вывести на экран самое длинное и самое короткое название
 * Вариант 6.  Дана строка. Подсчитать сколько раз в ней встречаются символы ‘a’, ’b’, ’c’. Символы считать вместе.
 * Вариант 7. Дана строка. Подсчитать сколько раз в ней встречаются символы ‘a’, ’b’, ’c’. Символы считать отдельно по каждому.
 * Вариант 8. Даны три фамилии. Выяснить есть ли среди них однофамильцы.
 * Вариант 9. Пользователь вводит имена трех человек. Определить, являются ли они тезками.
 * Вариант 10. Пользователь вводит 5 строк с консоли. «Склеить» эти слова в одно предложение.*/

package javaPlainLanguage.practicalWork5WorkingWithStrings;

public class Task1 {
}
