/**
 * 1 Дано время A и время B. Определить промежуток времени между ними в часах.
 * 2 Дано время A и время B. Определить промежуток времени между ними в минутах.
 * 3 Определить сколько времени (в минутах)  прошло с начала текущей пары. Создать 2 объекта LocalTime - для текущего времени и времени соответствующего началу пары.
 * 4 Пользователь вводить две даты. Определить, равны ли они.
 * 5 Определить, за какой промежуток времени выполняется сортировка массива из 10 000 элементов методом пузырька
 * 6 Даны три даты- A, B и C. Определить между какими из них наиболее короткий промежуток времени (в днях).
 * 7 Даны три даты- A, B и C. Определить между какими из них наиболее длительный промежуток времени (выраженный в месяцах)
 * 8 Дано время A. Определить сколько времени осталось/прошло до/с начала второй пары (чч:мм).
 * 9 Текущая дата- A. Определить промежуток времени до вашего дня рождения  (в месяцах/днях).
 * 10 Определить промежуток времени с начала пары A  до пары B (Создать 2 объекта LocalTime - для времени начала пары A и B).*/


package javaPlainLanguage.practicalWork10DateTimeAPI;

public class Task1 {
}
