/**
 * 1. Дана строка 'aba aca aea abba adca abea'. Напишите регулярное выражение, которое найдет строки abba и abea, не захватив adca.
 * 2. Составить регулярное выражение для поиска даты рождения в следующем формате: 01.07.1990
 * 3.  Дана строка '2+3 223 2223'. Напишите регулярное выражение, которое найдет строку 2+3, не захватив остальные
 * 4. Составить регулярное выражение для поиска всех e-mail адресов с доменом второго уровня gmail
 * 5. Составить регулярное выражение для поиска номера телефона в следующем формате: 8(7152)46-76-01
 * 6. Составить регулярное выражение для поиска e-mail адресов с доменом первого уровня net
 * 7. Дана строка '23 2+3 2++3 2+++3 345 567'. Напишите регулярное выражение, которое найдет строки 2+3, 2++3, 2+++3, не захватив остальные (+ может быть любое количество).
 * 8. Составить регулярное выражение для поиска адреса сайта с доменом третьего уровня в формате: javaeasy.beget.com
 * 9. Составить регулярное выражение для поиска года в формате: 2021г
 * 10. Составить регулярное выражение, определяющее является ли заданная строка IP адресом в формате: 192.168.54.692*/


package javaPlainLanguage.practicalWork9WorkingWithRegularExpressions;

public class Task1 {
}
