/**1. Создать текстовый файл и записать в него новую строку с текстом «HELLO WORLD» и добавить в него ту же строку, но в перевернутом виде.
 2. Имеется предварительно созданный текстовый файл, содержащий строку «HELLO WORLD». Поменять  в нем слова местами («HELLO WORLD»  «WORLD HELLO»).
 3. Имеется предварительно созданный текстовый файл. Подсчитать количество символов в нем.
 4. Имеется предварительно созданный текстовый файл. Подсчитать количество слов в нем.
 5. Создать текстовый файл и записать в него дату выполнения данной практической работы
 6. Создать текстовый файл и записать в него ваше ФИО (на латинице) в формате:
 Фамилия
 Имя
 Отчество
 7. Имеется предварительно созданный текстовый файл с каким-либо текстом. ДОПИСАТЬ в него свою фамилию (на латинице).
 8. Создать текстовый файл и записать в него 5 одинаковых строк. Записываемую строку должен ввести пользователь (на латинице).
 9. Создать текстовый файл и записать в него 5 различных текстовых строк. Записываемые строки должен ввести (на латинице) пользователь.
 10. Создать текстовый файл. Записать в него любое слово и тем же словом назвать (программно) файл*/


package javaPlainLanguage.practicalWork6WorkingWithFiles;

public class Test1 {
}
