/**
 * 1. Создать метод для определения площади треугольника. Вычислить площади трех разных треугольников.
 * 2. Создать метод для определения периметра прямоугольника. Вычислить периметр четырех разных прямоугольников.
 * 3. Создать метод для определения является ли фигура квадратом. Входные данные должен вводить пользователь.
 * 4. Даны два натуральных числа. Выяснить, в каком из них сумма цифр больше. (Определить метод для расчета суммы цифр натурального числа.)
 * 5. Дано предложение. Найти общее количество букв н в них. (Определить метод для расчета количества букв н в предложении.)
 * 6. Дан массив из произвольного количества элементов. Создать метод для вывода всех элементов массива в виде:
 * Элемент №0, его значение – 19
 * Элемент №1, его значение – 11
 * Элемент №2, его значение – 5
 * Элемент №n, его значение – m
 * 7. Дан массив из 20 элементов. Определить метод для вычисления количества нечетных значений элементов
 * 8. Дан массив из 33 элементов. Определить метод для вычисления количества четных значений элементов
 * 9. Дан массив из 15 элементов. Определить метод для вывода и заполнения массива случайными числами в пределах от m до n (m и n вводится с клавиатуры)*/


package javaPlainLanguage.practicalWork7ProgrammingMethods;

public class Task1 {
}
